In [1]:
import pandas as pd

In [2]:
loan_df = pd.read_csv("data/loan.csv")

In [3]:
loan_df.head()

,loan_id,married_or_not,self_employed_or_not,applicant_income,loan_amount,property_area,loan_status
0,LP1003,Y,N,4583,128.4,Rural,N
1,LP1005,Y,Y,3000,66.0,City,Y
2,LP1006,Y,N,2583,120.5,City,Y
3,LP1008,N,N,6000,141.4,City,Y
4,LP1011,Y,Y,5417,267.4,City,Y

In [4]:
loan_df.tail()

,loan_id,married_or_not,self_employed_or_not,applicant_income,loan_amount,property_area,loan_status
595,LP2974,Y,N,3232,108.6,Rural,Y
596,LP2979,Y,N,4106,40.7,Rural,Y
597,LP2983,Y,N,8072,253.4,City,Y
598,LP2984,Y,N,7583,187.6,City,Y
599,LP2990,N,Y,4583,133.2,Suburb,N

In [5]:
loan_df.shape

(600, 7)

In [6]:
loan_df.dtypes

loan_id                  object
married_or_not           object
self_employed_or_not     object
applicant_income          int64
loan_amount             float64
property_area            object
loan_status              object
dtype: object

In [7]:
loan_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 7 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   loan_id               600 non-null    object
 1   married_or_not        600 non-null    object
 2   self_employed_or_not  568 non-null    object
 3   applicant_income      600 non-null    int64
 4   loan_amount           589 non-null    float64
 5   property_area         600 non-null    object
 6   loan_status           600 non-null    object
dtypes: float64(1), int64(1), object(5)
memory usage: 32.9+ KB

In [8]:
loan_df.describe(include='all')

,loan_id,married_or_not,self_employed_or_not,applicant_income,loan_amount,property_area,loan_status
count,600,600,568,600.000000,589.000000,600,600
unique,600,2,2,NaN,NaN,3,2
top,LP1003,Y,N,NaN,NaN,Suburb,Y
freq,1,390,488,NaN,NaN,228,408
mean,NaN,NaN,NaN,5412.161667,146.971307,NaN,NaN
std,NaN,NaN,NaN,6160.362669,85.756442,NaN,NaN
min,NaN,NaN,NaN,150.000000,9.200000,NaN,NaN
25%,NaN,NaN,NaN,2880.500000,100.700000,NaN,NaN
50%,NaN,NaN,NaN,3806.000000,128.000000,NaN,NaN
75%,NaN,NaN,NaN,5785.000000,168.300000,NaN,NaN
max,NaN,NaN,NaN,81000.000000,700.300000,NaN,NaN

In [9]:
loan_df.sort_values(by='loan_amount', ascending=False)

,loan_id,married_or_not,self_employed_or_not,applicant_income,loan_amount,property_area,loan_status
163,LP1585,Y,N,51763,700.3,City,Y
122,LP1469,N,Y,20166,650.2,City,Y
548,LP2813,Y,Y,19484,600.4,Suburb,Y
147,LP1536,Y,N,39999,600.0,Suburb,Y
359,LP2191,Y,N,19730,570.1,Rural,N
...,...,...,...,...,...,...,...
377,LP2243,Y,N,3010,NaN,City,N
467,LP2533,Y,N,2947,NaN,City,N
512,LP2697,N,N,4680,NaN,Suburb,N
538,LP2778,Y,Y,6633,NaN,Rural,N
592,LP2960,Y,N,2400,NaN,City,N

In [10]:
loan_df.set_index("loan_id", inplace=True)

In [11]:
loan_df

,married_or_not,self_employed_or_not,applicant_income,loan_amount,property_area,loan_status
loan_id,,,,,,
LP1003,Y,N,4583,128.4,Rural,N
LP1005,Y,Y,3000,66.0,City,Y
LP1006,Y,N,2583,120.5,City,Y
LP1008,N,N,6000,141.4,City,Y
LP1011,Y,Y,5417,267.4,City,Y
...,...,...,...,...,...,...
LP2974,Y,N,3232,108.6,Rural,Y
LP2979,Y,N,4106,40.7,Rural,Y
LP2983,Y,N,8072,253.4,City,Y
LP2984,Y,N,7583,187.6,City,Y
LP2990,N,Y,4583,133.2,Suburb,N

In [12]:
loan_df.reset_index()

,loan_id,married_or_not,self_employed_or_not,applicant_income,loan_amount,property_area,loan_status
0,LP1003,Y,N,4583,128.4,Rural,N
1,LP1005,Y,Y,3000,66.0,City,Y
2,LP1006,Y,N,2583,120.5,City,Y
3,LP1008,N,N,6000,141.4,City,Y
4,LP1011,Y,Y,5417,267.4,City,Y
...,...,...,...,...,...,...,...
595,LP2974,Y,N,3232,108.6,Rural,Y
596,LP2979,Y,N,4106,40.7,Rural,Y
597,LP2983,Y,N,8072,253.4,City,Y
598,LP2984,Y,N,7583,187.6,City,Y
599,LP2990,N,Y,4583,133.2,Suburb,N

In [13]:
loan_df.columns

Index(['married_or_not', 'self_employed_or_not', 'applicant_income',
       'loan_amount', 'property_area', 'loan_status'],
      dtype='object')

In [14]:
loan_df.columns = ['married', 'self_employed', 'applicant_income',
       'loan_amount', 'property_area', 'loan_status']

In [15]:
loan_df

,married,self_employed,applicant_income,loan_amount,property_area,loan_status
loan_id,,,,,,
LP1003,Y,N,4583,128.4,Rural,N
LP1005,Y,Y,3000,66.0,City,Y
LP1006,Y,N,2583,120.5,City,Y
LP1008,N,N,6000,141.4,City,Y
LP1011,Y,Y,5417,267.4,City,Y
...,...,...,...,...,...,...
LP2974,Y,N,3232,108.6,Rural,Y
LP2979,Y,N,4106,40.7,Rural,Y
LP2983,Y,N,8072,253.4,City,Y
LP2984,Y,N,7583,187.6,City,Y
LP2990,N,Y,4583,133.2,Suburb,N

In [16]:
new_col = {'applicant_income':'income','loan_amount':'amount'}

In [17]:
loan_df.rename(columns=new_col,inplace=True)

In [18]:
loan_df

        married self_employed  income  amount property_area loan_status
loan_id
LP1003        Y             N    4583   128.4         Rural           N
LP1005        Y             Y    3000    66.0          City           Y
LP1006        Y             N    2583   120.5          City           Y
LP1008        N             N    6000   141.4          City           Y
LP1011        Y             Y    5417   267.4          City           Y
...         ...           ...     ...     ...           ...         ...
LP2974        Y             N    3232   108.6         Rural           Y
LP2979        Y             N    4106    40.7         Rural           Y
LP2983        Y             N    8072   253.4          City           Y
LP2984        Y             N    7583   187.6          City           Y
LP2990        N             Y    4583   133.2        Suburb           N

[600 rows x 6 columns]

In [19]:
loan_df.dtypes

married           object
self_employed     object
income             int64
amount           float64
property_area     object
loan_status       object
dtype: object

In [20]:
loan_df['income'] = loan_df['income'].astype('float64')

In [21]:
loan_df.dtypes

married           object
self_employed     object
income           float64
amount           float64
property_area     object
loan_status       object
dtype: object

In [22]:
a = loan_df['amount']

In [23]:
a

loan_id
LP1003    128.4
LP1005     66.0
LP1006    120.5
LP1008    141.4
LP1011    267.4
          ...
LP2974    108.6
LP2979     40.7
LP2983    253.4
LP2984    187.6
LP2990    133.2
Name: amount, Length: 600, dtype: float64

In [24]:
a.dtype

dtype('float64')

In [25]:
a.describe()

count    589.000000
mean     146.971307
std       85.756442
min        9.200000
25%      100.700000
50%      128.000000
75%      168.300000
max      700.300000
Name: amount, dtype: float64

In [26]:
b= loan_df['self_employed']

In [27]:
b.dtype

dtype('O')

In [28]:
b.describe()

count     568
unique      2
top         N
freq      488
Name: self_employed, dtype: object

In [29]:
b.unique()

array(['N', 'Y', nan], dtype=object)

In [30]:
b.value_counts()

self_employed
N    488
Y     80
Name: count, dtype: int64

In [31]:
b.value_counts(dropna=False)

self_employed
N      488
Y       80
NaN     32
Name: count, dtype: int64

In [32]:
b.value_counts(dropna=False, normalize=True)

self_employed
N      0.813333
Y      0.133333
NaN    0.053333
Name: proportion, dtype: float64

In [33]:
loan_df[['amount','income']]

         amount  income
loan_id
LP1003    128.4  4583.0
LP1005     66.0  3000.0
LP1006    120.5  2583.0
LP1008    141.4  6000.0
LP1011    267.4  5417.0
...         ...     ...
LP2974    108.6  3232.0
LP2979     40.7  4106.0
LP2983    253.4  8072.0
LP2984    187.6  7583.0
LP2990    133.2  4583.0

[600 rows x 2 columns]

In [34]:
loan_df[['amount']]

         amount
loan_id
LP1003    128.4
LP1005     66.0
LP1006    120.5
LP1008    141.4
LP1011    267.4
...         ...
LP2974    108.6
LP2979     40.7
LP2983    253.4
LP2984    187.6
LP2990    133.2

[600 rows x 1 columns]

In [35]:
import pandas as pd

loan_df = pd.read_csv('data/loan.csv')
loan_df = loan_df.set_index('loan_id')
new_columns = {'married_or_not': 'married',
               'self_employed_or_not': 'self_employed',
               'applicant_income': 'income',
               'loan_amount': 'amount'}
loan_df = loan_df.rename(columns=new_columns)

# 여기에 코드를 작성하세요.
loan_df['property_area'].value_counts(normalize=True)

property_area
Suburb    0.380000
City      0.328333
Rural     0.291667
Name: proportion, dtype: float64

In [36]:
c1 = loan_df['married'] == 'Y'

In [37]:
c2 = loan_df['income'] > loan_df['income'].mean()

In [38]:
loan_df[c1 & c2]

        married self_employed  income  amount property_area loan_status
loan_id
LP1011        Y             Y    5417   267.4          City           Y
LP1020        Y             N   12841   349.3        Suburb           N
LP1043        Y             N    7660   104.1          City           N
LP1046        Y             N    5955   315.5          City           Y
LP1066        Y             Y    9560   191.1        Suburb           Y
...         ...           ...     ...     ...           ...         ...
LP2948        Y             N    5780   192.9          City           Y
LP2953        Y             N    5703   128.5          City           Y
LP2959        Y             N   12000   497.0        Suburb           Y
LP2983        Y             N    8072   253.4          City           Y
LP2984        Y             N    7583   187.6          City           Y

[120 rows x 6 columns]

In [39]:
loan_df[c1|c2]

        married self_employed  income  amount property_area loan_status
loan_id
LP1003        Y             N    4583   128.4         Rural           N
LP1005        Y             Y    3000    66.0          City           Y
LP1006        Y             N    2583   120.5          City           Y
LP1008        N             N    6000   141.4          City           Y
LP1011        Y             Y    5417   267.4          City           Y
...         ...           ...     ...     ...           ...         ...
LP2964        Y             N    3987   157.3         Rural           Y
LP2974        Y             N    3232   108.6         Rural           Y
LP2979        Y             N    4106    40.7         Rural           Y
LP2983        Y             N    8072   253.4          City           Y
LP2984        Y             N    7583   187.6          City           Y

[442 rows x 6 columns]

In [40]:
c3 = loan_df['property_area'] == 'city'

In [41]:
loan_df[c1|c2 & ~c3]

        married self_employed  income  amount property_area loan_status
loan_id
LP1003        Y             N    4583   128.4         Rural           N
LP1005        Y             Y    3000    66.0          City           Y
LP1006        Y             N    2583   120.5          City           Y
LP1008        N             N    6000   141.4          City           Y
LP1011        Y             Y    5417   267.4          City           Y
...         ...           ...     ...     ...           ...         ...
LP2964        Y             N    3987   157.3         Rural           Y
LP2974        Y             N    3232   108.6         Rural           Y
LP2979        Y             N    4106    40.7         Rural           Y
LP2983        Y             N    8072   253.4          City           Y
LP2984        Y             N    7583   187.6          City           Y

[442 rows x 6 columns]

In [42]:
import pandas as pd

loan_df = pd.read_csv('data/loan.csv')
loan_df = loan_df.set_index('loan_id')
new_columns = {'married_or_not': 'married',
               'self_employed_or_not': 'self_employed',
               'applicant_income': 'income',
               'loan_amount': 'amount'}
loan_df = loan_df.rename(columns=new_columns)

# 여기에 코드를 작성하세요.

c1 = loan_df['loan_status'] == 'Y'
c2 = loan_df['self_employed'] == "N"
c3 = loan_df['income'] >= loan_df['income'].median()

group1 = loan_df[c1 & c2 & c3]

group1

        married self_employed  income  amount property_area loan_status
loan_id
LP1008        N             N    6000   141.4          City           Y
LP1018        Y             N    4006   168.6          City           Y
LP1032        N             N    4950   125.2          City           Y
LP1046        Y             N    5955   315.5          City           Y
LP1073        Y             N    4226   110.2          City           Y
...         ...           ...     ...     ...           ...         ...
LP2959        Y             N   12000   497.0        Suburb           Y
LP2964        Y             N    3987   157.3         Rural           Y
LP2979        Y             N    4106    40.7         Rural           Y
LP2983        Y             N    8072   253.4          City           Y
LP2984        Y             N    7583   187.6          City           Y

[159 rows x 6 columns]

In [43]:
loan_df.drop("LP1006")

        married self_employed  income  amount property_area loan_status
loan_id
LP1003        Y             N    4583   128.4         Rural           N
LP1005        Y             Y    3000    66.0          City           Y
LP1008        N             N    6000   141.4          City           Y
LP1011        Y             Y    5417   267.4          City           Y
LP1013        Y             N    2333    95.3          City           Y
...         ...           ...     ...     ...           ...         ...
LP2974        Y             N    3232   108.6         Rural           Y
LP2979        Y             N    4106    40.7         Rural           Y
LP2983        Y             N    8072   253.4          City           Y
LP2984        Y             N    7583   187.6          City           Y
LP2990        N             Y    4583   133.2        Suburb           N

[599 rows x 6 columns]

In [44]:
loan_df.drop(columns='married')

        self_employed  income  amount property_area loan_status
loan_id
LP1003              N    4583   128.4         Rural           N
LP1005              Y    3000    66.0          City           Y
LP1006              N    2583   120.5          City           Y
LP1008              N    6000   141.4          City           Y
LP1011              Y    5417   267.4          City           Y
...               ...     ...     ...           ...         ...
LP2974              N    3232   108.6         Rural           Y
LP2979              N    4106    40.7         Rural           Y
LP2983              N    8072   253.4          City           Y
LP2984              N    7583   187.6          City           Y
LP2990              Y    4583   133.2        Suburb           N

[600 rows x 5 columns]

In [45]:
import pandas as pd

loan_df = pd.read_csv('data/loan.csv')
loan_df = loan_df.set_index('loan_id')
new_columns = {'married_or_not': 'married',
               'self_employed_or_not': 'self_employed',
               'applicant_income': 'income',
               'loan_amount': 'amount'}
loan_df = loan_df.rename(columns=new_columns)

# 여기에 코드를 작성하세요.
loan_df.drop('loan_status',axis=1,inplace=True)
loan_df

        married self_employed  income  amount property_area
loan_id
LP1003        Y             N    4583   128.4         Rural
LP1005        Y             Y    3000    66.0          City
LP1006        Y             N    2583   120.5          City
LP1008        N             N    6000   141.4          City
LP1011        Y             Y    5417   267.4          City
...         ...           ...     ...     ...           ...
LP2974        Y             N    3232   108.6         Rural
LP2979        Y             N    4106    40.7         Rural
LP2983        Y             N    8072   253.4          City
LP2984        Y             N    7583   187.6          City
LP2990        N             Y    4583   133.2        Suburb

[600 rows x 5 columns]

In [46]:
airbnb_df = pd.read_csv("data/airbnb.csv")
airbnb_df

,id,state,guests,beds,property_type,rating,n_reviews,location,price
0,BF1406,Illinois,2,1,Apartment,96.0,55,"Avondale, Chicago.",48
1,DB7921,MASSACHUSETTS,4,1,Apartment,NaN,0,"South End, Boston.",115
2,OZ5857,ILLINOIS,4,3,Apartment,100.0,51,"Avondale, Chicago.",150
3,HY8797,california,2,1,Apartment,75.0,4,"SoMa, San Francisco.",125
4,VN7858,massachusetts,2,1,House,88.0,23,"West Roxbury, Boston.",64
...,...,...,...,...,...,...,...,...,...
708,XG3289,California,2,1,Apartment,97.0,60,"Venice, Los Angeles.",150
709,ZR5298,california,4,2,Apartment,93.0,3,"Mid-Wilshire, Los Angeles.",100
710,XZ5531,California,2,1,Bungalow,93.0,3,"Redondo Beach, Los Angeles.",100
711,EE8333,ILLINOIS,2,1,House,80.0,15,"Lakeview, Chicago.",115
712,AA6024,Massachusetts,3,1,Apartment,96.0,61,"East Boston, Boston.",115

In [47]:
airbnb_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 713 entries, 0 to 712
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             713 non-null    object
 1   state          713 non-null    object
 2   guests         713 non-null    int64
 3   beds           713 non-null    int64
 4   property_type  713 non-null    object
 5   rating         700 non-null    float64
 6   n_reviews      713 non-null    int64
 7   location       713 non-null    object
 8   price          713 non-null    int64
dtypes: float64(1), int64(4), object(4)
memory usage: 50.3+ KB

In [48]:
airbnb_df.isna()

,id,state,guests,beds,property_type,rating,n_reviews,location,price
0,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,True,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...
708,False,False,False,False,False,False,False,False,False
709,False,False,False,False,False,False,False,False,False
710,False,False,False,False,False,False,False,False,False
711,False,False,False,False,False,False,False,False,False
712,False,False,False,False,False,False,False,False,False

In [49]:
airbnb_df.isna().sum()

id                0
state             0
guests            0
beds              0
property_type     0
rating           13
n_reviews         0
location          0
price             0
dtype: int64

In [50]:
airbnb_df.isna().any(axis=1)

0      False
1       True
2      False
3      False
4      False
       ...
708    False
709    False
710    False
711    False
712    False
Length: 713, dtype: bool

In [51]:
airbnb_df[airbnb_df.isna().any(axis=1)]

,id,state,guests,beds,property_type,rating,n_reviews,location,price
1,DB7921,MASSACHUSETTS,4,1,Apartment,NaN,0,"South End, Boston.",115
127,MB7199,Illinois,2,1,Apartment,NaN,0,"Rogers Park, Chicago.",74
189,DE6323,illinois,2,1,Condominium,NaN,0,"South Loop/Printers Row, Chicago.",79
206,ME5527,ILLINOIS,2,1,House,NaN,0,"Garfield Park, Chicago.",52
272,RM9271,illinois,2,1,Apartment,NaN,0,"Lincoln Park, Chicago.",64
275,TA9777,California,2,1,Condominium,NaN,0,"Pacific Heights, San Francisco.",115
366,LP6045,ILLINOIS,2,1,Apartment,NaN,0,"Loop, Chicago.",115
534,DC4208,ILLINOIS,5,3,House,NaN,0,"Little Italy/UIC, Chicago.",100
546,IE7576,illinois,1,1,House,NaN,0,"South Chicago, Chicago.",50
552,DY9962,California,1,1,Condominium,NaN,0,"Valley Village, Los Angeles.",85
586,UW2000,California,8,1,Other,NaN,0,"South LA, Los Angeles.",169
594,VM7350,ILLINOIS,2,1,Apartment,NaN,0,"Little Italy/UIC, Chicago.",46
632,NH9205,California,4,2,Apartment,NaN,0,"El Segundo, Los Angeles.",100

In [52]:
airbnb_df.dropna()

,id,state,guests,beds,property_type,rating,n_reviews,location,price
0,BF1406,Illinois,2,1,Apartment,96.0,55,"Avondale, Chicago.",48
2,OZ5857,ILLINOIS,4,3,Apartment,100.0,51,"Avondale, Chicago.",150
3,HY8797,california,2,1,Apartment,75.0,4,"SoMa, San Francisco.",125
4,VN7858,massachusetts,2,1,House,88.0,23,"West Roxbury, Boston.",64
5,PP4626,California,2,1,Apartment,92.0,211,"Western Addition/NOPA, San Francisco.",129
...,...,...,...,...,...,...,...,...,...
708,XG3289,California,2,1,Apartment,97.0,60,"Venice, Los Angeles.",150
709,ZR5298,california,4,2,Apartment,93.0,3,"Mid-Wilshire, Los Angeles.",100
710,XZ5531,California,2,1,Bungalow,93.0,3,"Redondo Beach, Los Angeles.",100
711,EE8333,ILLINOIS,2,1,House,80.0,15,"Lakeview, Chicago.",115
712,AA6024,Massachusetts,3,1,Apartment,96.0,61,"East Boston, Boston.",115

In [53]:
am = airbnb_df['rating'].mean()

In [54]:
airbnb_df['rating'] = airbnb_df['rating'].fillna(am)

In [55]:
airbnb_df.isna().sum()

id               0
state            0
guests           0
beds             0
property_type    0
rating           0
n_reviews        0
location         0
price            0
dtype: int64

In [56]:
import pandas as pd

cellphone_df = pd.read_csv('data/cellphone.csv')

# 여기에 코드를 작성하세요.
wna = cellphone_df.isna().any(axis=1)
cellphone_df[wna]

cellphone_df['weight'] = cellphone_df['weight'].fillna(140)

c1 = cellphone_df['year'] == 2021

cellphone_df[c1]

,brand,name,size,price,battery,weight,year
26,apple,iPhone 13 (128GB),"6.1""",1090.0,3227,173.0,2021
27,Apple,iPhone 13 (256GB),"6.1""",1230.0,3227,173.0,2021
28,apple,iPhone 13 (512GB),"6.1""",1500.0,3227,173.0,2021
29,APPLE,iPhone 13 Pro (128GB),"6.1""",1350.0,3095,203.0,2021
30,Apple,iPhone 13 Pro (256GB),"6.1""",1490.0,3095,203.0,2021
31,Apple,iPhone 13 Pro (512GB),"6.1""",1760.0,3095,203.0,2021
32,Apple,iPhone 13 Pro (1TB),"6.1""",2030.0,3095,203.0,2021
33,apple,iPhone 13 Pro Max (128GB),"6.7""",1490.0,4352,238.0,2021
34,Apple,iPhone 13 Pro Max (256GB),"6.7""",1630.0,4352,238.0,2021
35,Apple,iPhone 13 Pro Max (512GB),"6.7""",1900.0,4352,238.0,2021
36,Apple,iPhone 13 Pro Max (1TB),"6.7""",2170.0,4352,238.0,2021
37,Apple,iPhone 13 mini (128GB),"5.4""",950.0,2406,140.0,2021
38,Apple,iPhone 13 mini (256GB),"5.4""",1090.0,2406,140.0,2021
39,APPLE,iPhone 13 mini (512GB),"5.4""",1360.0,2406,140.0,2021
40,SAMSUNG,Galaxy A12 (32GB),"6.5""",275.0,5000,205.0,2021
41,samsung,Galaxy S21 (256GB),"6.2""",999.9,4000,169.0,2021
42,SAMSUNG,Galaxy S21 Ultra (256GB),"6.8""",1452.0,5000,227.0,2021
43,samsung,Galaxy S21 Ultra (512GB),"6.8""",1599.4,5000,227.0,2021
44,SAMSUNG,Galaxy S21+ (256GB),"6.7""",1199.0,4800,200.0,2021
45,SAMSUNG,Galaxy Z Flip3 (256GB),"6.7""",1254.0,3300,183.0,2021
46,Samsung,Galaxy Z Fold3 (256GB),"7.6""",1998.7,4400,271.0,2021
47,samsung,Galaxy Z Fold3 (512GB),"7.6""",2097.7,4400,271.0,2021
48,samsung,Galaxy Z Fold3 Thom Browne Edition (512GB),"7.6""",3960.0,4400,271.0,2021

In [57]:
airbnb_df.duplicated().sum()

np.int64(2)

In [58]:
airbnb_df[airbnb_df.duplicated()]

,id,state,guests,beds,property_type,rating,n_reviews,location,price
493,UD8253,MASSACHUSETTS,3,1,Apartment,100.0,1,"Fenway/Kenmore, Boston.",124
496,UD8253,MASSACHUSETTS,3,1,Apartment,100.0,1,"Fenway/Kenmore, Boston.",124

In [59]:
airbnb_df[airbnb_df.duplicated(subset='id')]

,id,state,guests,beds,property_type,rating,n_reviews,location,price
448,LN3479,California,2,2,Apartment,98.0,19,"East Hollywood, Los Angeles.",88
452,LN3479,California,2,2,Apartment,99.0,25,"East Hollywood, Los Angeles.",91
493,UD8253,MASSACHUSETTS,3,1,Apartment,100.0,1,"Fenway/Kenmore, Boston.",124
496,UD8253,MASSACHUSETTS,3,1,Apartment,100.0,1,"Fenway/Kenmore, Boston.",124
527,QO8555,California,7,4,House,80.0,1,"Excelsior, San Francisco.",199
601,BZ3596,Illinois,2,1,House,89.0,30,"Lakeview, Chicago.",119

In [60]:
airbnb_df[airbnb_df.duplicated(subset='id',keep='first')]

,id,state,guests,beds,property_type,rating,n_reviews,location,price
448,LN3479,California,2,2,Apartment,98.0,19,"East Hollywood, Los Angeles.",88
452,LN3479,California,2,2,Apartment,99.0,25,"East Hollywood, Los Angeles.",91
493,UD8253,MASSACHUSETTS,3,1,Apartment,100.0,1,"Fenway/Kenmore, Boston.",124
496,UD8253,MASSACHUSETTS,3,1,Apartment,100.0,1,"Fenway/Kenmore, Boston.",124
527,QO8555,California,7,4,House,80.0,1,"Excelsior, San Francisco.",199
601,BZ3596,Illinois,2,1,House,89.0,30,"Lakeview, Chicago.",119

In [61]:
airbnb_df[airbnb_df.duplicated(subset='id',keep='last')]

,id,state,guests,beds,property_type,rating,n_reviews,location,price
6,LN3479,California,2,2,Apartment,96.0,15,"East Hollywood, Los Angeles.",88
201,UD8253,MASSACHUSETTS,3,1,Apartment,100.0,1,"Fenway/Kenmore, Boston.",124
273,QO8555,California,7,4,House,85.0,3,"Excelsior, San Francisco.",199
448,LN3479,California,2,2,Apartment,98.0,19,"East Hollywood, Los Angeles.",88
493,UD8253,MASSACHUSETTS,3,1,Apartment,100.0,1,"Fenway/Kenmore, Boston.",124
541,BZ3596,Illinois,2,1,Apartment,91.0,28,"Lakeview, Chicago.",119

In [62]:
airbnb_df[airbnb_df.duplicated(subset='id',keep=False)]

,id,state,guests,beds,property_type,rating,n_reviews,location,price
6,LN3479,California,2,2,Apartment,96.0,15,"East Hollywood, Los Angeles.",88
201,UD8253,MASSACHUSETTS,3,1,Apartment,100.0,1,"Fenway/Kenmore, Boston.",124
273,QO8555,California,7,4,House,85.0,3,"Excelsior, San Francisco.",199
448,LN3479,California,2,2,Apartment,98.0,19,"East Hollywood, Los Angeles.",88
452,LN3479,California,2,2,Apartment,99.0,25,"East Hollywood, Los Angeles.",91
493,UD8253,MASSACHUSETTS,3,1,Apartment,100.0,1,"Fenway/Kenmore, Boston.",124
496,UD8253,MASSACHUSETTS,3,1,Apartment,100.0,1,"Fenway/Kenmore, Boston.",124
527,QO8555,California,7,4,House,80.0,1,"Excelsior, San Francisco.",199
541,BZ3596,Illinois,2,1,Apartment,91.0,28,"Lakeview, Chicago.",119
601,BZ3596,Illinois,2,1,House,89.0,30,"Lakeview, Chicago.",119

In [63]:
airbnb_df.drop_duplicates()

,id,state,guests,beds,property_type,rating,n_reviews,location,price
0,BF1406,Illinois,2,1,Apartment,96.00,55,"Avondale, Chicago.",48
1,DB7921,MASSACHUSETTS,4,1,Apartment,94.82,0,"South End, Boston.",115
2,OZ5857,ILLINOIS,4,3,Apartment,100.00,51,"Avondale, Chicago.",150
3,HY8797,california,2,1,Apartment,75.00,4,"SoMa, San Francisco.",125
4,VN7858,massachusetts,2,1,House,88.00,23,"West Roxbury, Boston.",64
...,...,...,...,...,...,...,...,...,...
708,XG3289,California,2,1,Apartment,97.00,60,"Venice, Los Angeles.",150
709,ZR5298,california,4,2,Apartment,93.00,3,"Mid-Wilshire, Los Angeles.",100
710,XZ5531,California,2,1,Bungalow,93.00,3,"Redondo Beach, Los Angeles.",100
711,EE8333,ILLINOIS,2,1,House,80.00,15,"Lakeview, Chicago.",115
712,AA6024,Massachusetts,3,1,Apartment,96.00,61,"East Boston, Boston.",115

In [64]:
airbnb_df.drop_duplicates(subset='id')

,id,state,guests,beds,property_type,rating,n_reviews,location,price
0,BF1406,Illinois,2,1,Apartment,96.00,55,"Avondale, Chicago.",48
1,DB7921,MASSACHUSETTS,4,1,Apartment,94.82,0,"South End, Boston.",115
2,OZ5857,ILLINOIS,4,3,Apartment,100.00,51,"Avondale, Chicago.",150
3,HY8797,california,2,1,Apartment,75.00,4,"SoMa, San Francisco.",125
4,VN7858,massachusetts,2,1,House,88.00,23,"West Roxbury, Boston.",64
...,...,...,...,...,...,...,...,...,...
708,XG3289,California,2,1,Apartment,97.00,60,"Venice, Los Angeles.",150
709,ZR5298,california,4,2,Apartment,93.00,3,"Mid-Wilshire, Los Angeles.",100
710,XZ5531,California,2,1,Bungalow,93.00,3,"Redondo Beach, Los Angeles.",100
711,EE8333,ILLINOIS,2,1,House,80.00,15,"Lakeview, Chicago.",115
712,AA6024,Massachusetts,3,1,Apartment,96.00,61,"East Boston, Boston.",115

In [65]:
airbnb_df = airbnb_df.drop_duplicates(subset='id',keep='last')

In [66]:
airbnb_df.duplicated().sum()

np.int64(0)

In [67]:
import pandas as pd

cellphone_df = pd.read_csv('data/cellphone.csv')

# 여기에 코드를 작성하세요.

cellphone_df.duplicated().sum()
cellphone_df[cellphone_df.duplicated()]

cellphone_df.drop_duplicates()

,brand,name,size,price,battery,weight,year
0,apple,iPhone 14 (128GB),"6.1""",1250.0,3729,172.0,2022
1,apple,iPhone 14 (256GB),"6.1""",1400.0,3729,172.0,2022
2,Apple,iPhone 14 (512GB),"6.1""",1700.0,3729,172.0,2022
3,apple,iPhone 14 Plus (128GB),"6.7""",1350.0,4325,203.0,2022
4,APPLE,iPhone 14 Plus (256GB),"6.7""",1500.0,4325,203.0,2022
...,...,...,...,...,...,...,...
65,SAMSUNG,Galaxy S20 Ultra (512GB),"6.9""",1793.0,5000,220.0,2020
66,samsung,Galaxy S20+ (256GB),"6.7""",1353.0,4500,186.0,2020
67,SAMSUNG,Galaxy Z Flip2 (256GB),"6.7""",1650.0,3300,183.0,2020
68,Samsung,Galaxy Z Fold2 (256GB),"7.6""",1892.0,4500,282.0,2020
69,samsung,Galaxy Z Fold2 Thom Browne Edition (256GB),"7.6""",3960.0,4500,282.0,2020

In [68]:
q1 = airbnb_df['price'].quantile(0.25)
q3 = airbnb_df['price'].quantile(0.75)

iqr = q3 - q1

low_lim = q1 - 1.5 * iqr
up_lim = q3 + 1.5 * iqr

c1 = airbnb_df['price'] < low_lim
c2 = airbnb_df['price'] > up_lim
c3 = airbnb_df['price'] >= low_lim
c4 = airbnb_df['price'] <= up_lim

airbnb_df[c1 | c2]
airbnb_df[c3 & c4]

,id,state,guests,beds,property_type,rating,n_reviews,location,price
0,BF1406,Illinois,2,1,Apartment,96.00,55,"Avondale, Chicago.",48
1,DB7921,MASSACHUSETTS,4,1,Apartment,94.82,0,"South End, Boston.",115
2,OZ5857,ILLINOIS,4,3,Apartment,100.00,51,"Avondale, Chicago.",150
3,HY8797,california,2,1,Apartment,75.00,4,"SoMa, San Francisco.",125
4,VN7858,massachusetts,2,1,House,88.00,23,"West Roxbury, Boston.",64
...,...,...,...,...,...,...,...,...,...
708,XG3289,California,2,1,Apartment,97.00,60,"Venice, Los Angeles.",150
709,ZR5298,california,4,2,Apartment,93.00,3,"Mid-Wilshire, Los Angeles.",100
710,XZ5531,California,2,1,Bungalow,93.00,3,"Redondo Beach, Los Angeles.",100
711,EE8333,ILLINOIS,2,1,House,80.00,15,"Lakeview, Chicago.",115
712,AA6024,Massachusetts,3,1,Apartment,96.00,61,"East Boston, Boston.",115

In [69]:
import pandas as pd

cellphone_df = pd.read_csv('data/cellphone.csv')

# 여기에 코드를 작성하세요.

q1 = cellphone_df['price'].quantile(0.25)
q3 = cellphone_df['price'].quantile(0.75)

iqr = q3 - q1

low_lim = q1 - 1.5 * iqr
up_lim = q3 + 1.5 * iqr

c1 = cellphone_df['price'] < low_lim
c2 = cellphone_df['price'] > up_lim
c3 = cellphone_df['price'] >= low_lim
c4 = cellphone_df['price'] <= up_lim

cellphone_df[c1 | c2]
cellphone_df[c3 & c4]

      brand                      name  size   price  battery  weight  year
0     apple         iPhone 14 (128GB)  6.1"  1250.0     3729   172.0  2022
1     apple         iPhone 14 (256GB)  6.1"  1400.0     3729   172.0  2022
2     Apple         iPhone 14 (512GB)  6.1"  1700.0     3729   172.0  2022
3     apple    iPhone 14 Plus (128GB)  6.7"  1350.0     4325   203.0  2022
4     APPLE    iPhone 14 Plus (256GB)  6.7"  1500.0     4325   203.0  2022
..      ...                       ...   ...     ...      ...     ...   ...
64  samsung  Galaxy S20 Ultra (256GB)  6.9"  1595.0     5000   220.0  2020
65  SAMSUNG  Galaxy S20 Ultra (512GB)  6.9"  1793.0     5000   220.0  2020
66  samsung       Galaxy S20+ (256GB)  6.7"  1353.0     4500   186.0  2020
67  SAMSUNG    Galaxy Z Flip2 (256GB)  6.7"  1650.0     3300   183.0  2020
68  Samsung    Galaxy Z Fold2 (256GB)  7.6"  1892.0     4500   282.0  2020

[67 rows x 7 columns]

In [70]:
airbnb_df['state'].unique()

array(['Illinois', 'MASSACHUSETTS', 'ILLINOIS', 'california',
       'massachusetts', 'California', 'Massachusetts', 'CALIFORNIA',
       'illinois'], dtype=object)

In [71]:
airbnb_df['state'].str.lower()

0           illinois
1      massachusetts
2           illinois
3         california
4      massachusetts
           ...
708       california
709       california
710       california
711         illinois
712    massachusetts
Name: state, Length: 707, dtype: object

In [72]:
airbnb_df['state'].str.upper()

0           ILLINOIS
1      MASSACHUSETTS
2           ILLINOIS
3         CALIFORNIA
4      MASSACHUSETTS
           ...
708       CALIFORNIA
709       CALIFORNIA
710       CALIFORNIA
711         ILLINOIS
712    MASSACHUSETTS
Name: state, Length: 707, dtype: object

In [73]:
airbnb_df.loc[:,'state'] = airbnb_df['state'].str.capitalize()

In [74]:
airbnb_df

,id,state,guests,beds,property_type,rating,n_reviews,location,price
0,BF1406,Illinois,2,1,Apartment,96.00,55,"Avondale, Chicago.",48
1,DB7921,Massachusetts,4,1,Apartment,94.82,0,"South End, Boston.",115
2,OZ5857,Illinois,4,3,Apartment,100.00,51,"Avondale, Chicago.",150
3,HY8797,California,2,1,Apartment,75.00,4,"SoMa, San Francisco.",125
4,VN7858,Massachusetts,2,1,House,88.00,23,"West Roxbury, Boston.",64
...,...,...,...,...,...,...,...,...,...
708,XG3289,California,2,1,Apartment,97.00,60,"Venice, Los Angeles.",150
709,ZR5298,California,4,2,Apartment,93.00,3,"Mid-Wilshire, Los Angeles.",100
710,XZ5531,California,2,1,Bungalow,93.00,3,"Redondo Beach, Los Angeles.",100
711,EE8333,Illinois,2,1,House,80.00,15,"Lakeview, Chicago.",115
712,AA6024,Massachusetts,3,1,Apartment,96.00,61,"East Boston, Boston.",115

In [75]:
airbnb_df['location'].str.split(',')

0               [Avondale,  Chicago.]
1               [South End,  Boston.]
2               [Avondale,  Chicago.]
3             [SoMa,  San Francisco.]
4            [West Roxbury,  Boston.]
                    ...
708           [Venice,  Los Angeles.]
709     [Mid-Wilshire,  Los Angeles.]
710    [Redondo Beach,  Los Angeles.]
711             [Lakeview,  Chicago.]
712           [East Boston,  Boston.]
Name: location, Length: 707, dtype: object

In [76]:
airbnb_df.loc[:,'neighborhood'] = airbnb_df['location'].str.split(',').str[0]
airbnb_df.loc[:,'city'] = airbnb_df['location'].str.split(',').str[1]

/var/folders/q8/4d2895412ql0wfqsb19srbvh0000gn/T/ipykernel_62935/3933384411.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  airbnb_df.loc[:,'neighborhood'] = airbnb_df['location'].str.split(',').str[0]
/var/folders/q8/4d2895412ql0wfqsb19srbvh0000gn/T/ipykernel_62935/3933384411.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  airbnb_df.loc[:,'city'] = airbnb_df['location'].str.split(',').str[1]

In [77]:
airbnb_df

,id,state,guests,beds,property_type,rating,n_reviews,location,price,neighborhood,city
0,BF1406,Illinois,2,1,Apartment,96.00,55,"Avondale, Chicago.",48,Avondale,Chicago.
1,DB7921,Massachusetts,4,1,Apartment,94.82,0,"South End, Boston.",115,South End,Boston.
2,OZ5857,Illinois,4,3,Apartment,100.00,51,"Avondale, Chicago.",150,Avondale,Chicago.
3,HY8797,California,2,1,Apartment,75.00,4,"SoMa, San Francisco.",125,SoMa,San Francisco.
4,VN7858,Massachusetts,2,1,House,88.00,23,"West Roxbury, Boston.",64,West Roxbury,Boston.
...,...,...,...,...,...,...,...,...,...,...,...
708,XG3289,California,2,1,Apartment,97.00,60,"Venice, Los Angeles.",150,Venice,Los Angeles.
709,ZR5298,California,4,2,Apartment,93.00,3,"Mid-Wilshire, Los Angeles.",100,Mid-Wilshire,Los Angeles.
710,XZ5531,California,2,1,Bungalow,93.00,3,"Redondo Beach, Los Angeles.",100,Redondo Beach,Los Angeles.
711,EE8333,Illinois,2,1,House,80.00,15,"Lakeview, Chicago.",115,Lakeview,Chicago.
712,AA6024,Massachusetts,3,1,Apartment,96.00,61,"East Boston, Boston.",115,East Boston,Boston.

In [78]:
airbnb_df = airbnb_df.drop(columns='location')

In [79]:
airbnb_df

,id,state,guests,beds,property_type,rating,n_reviews,price,neighborhood,city
0,BF1406,Illinois,2,1,Apartment,96.00,55,48,Avondale,Chicago.
1,DB7921,Massachusetts,4,1,Apartment,94.82,0,115,South End,Boston.
2,OZ5857,Illinois,4,3,Apartment,100.00,51,150,Avondale,Chicago.
3,HY8797,California,2,1,Apartment,75.00,4,125,SoMa,San Francisco.
4,VN7858,Massachusetts,2,1,House,88.00,23,64,West Roxbury,Boston.
...,...,...,...,...,...,...,...,...,...,...
708,XG3289,California,2,1,Apartment,97.00,60,150,Venice,Los Angeles.
709,ZR5298,California,4,2,Apartment,93.00,3,100,Mid-Wilshire,Los Angeles.
710,XZ5531,California,2,1,Bungalow,93.00,3,100,Redondo Beach,Los Angeles.
711,EE8333,Illinois,2,1,House,80.00,15,115,Lakeview,Chicago.
712,AA6024,Massachusetts,3,1,Apartment,96.00,61,115,East Boston,Boston.

In [80]:
airbnb_df['city'].unique()

array([' Chicago.', ' Boston.', ' San Francisco.', ' Los Angeles.'],
      dtype=object)

In [81]:
airbnb_df.loc[:,'city'] = airbnb_df['city'].str.strip()

In [82]:
airbnb_df['city'].unique()

array(['Chicago.', 'Boston.', 'San Francisco.', 'Los Angeles.'],
      dtype=object)

In [83]:
airbnb_df.loc[:,'city'] = airbnb_df['city'].str.replace('.','', regex=False)

In [84]:
airbnb_df

,id,state,guests,beds,property_type,rating,n_reviews,price,neighborhood,city
0,BF1406,Illinois,2,1,Apartment,96.00,55,48,Avondale,Chicago
1,DB7921,Massachusetts,4,1,Apartment,94.82,0,115,South End,Boston
2,OZ5857,Illinois,4,3,Apartment,100.00,51,150,Avondale,Chicago
3,HY8797,California,2,1,Apartment,75.00,4,125,SoMa,San Francisco
4,VN7858,Massachusetts,2,1,House,88.00,23,64,West Roxbury,Boston
...,...,...,...,...,...,...,...,...,...,...
708,XG3289,California,2,1,Apartment,97.00,60,150,Venice,Los Angeles
709,ZR5298,California,4,2,Apartment,93.00,3,100,Mid-Wilshire,Los Angeles
710,XZ5531,California,2,1,Bungalow,93.00,3,100,Redondo Beach,Los Angeles
711,EE8333,Illinois,2,1,House,80.00,15,115,Lakeview,Chicago
712,AA6024,Massachusetts,3,1,Apartment,96.00,61,115,East Boston,Boston

In [85]:
import pandas as pd

cellphone_df = pd.read_csv('data/cellphone.csv')

# 여기에 코드를 작성하세요.
cellphone_df['brand'] = cellphone_df['brand'].str.capitalize()

cellphone_df['model'] = cellphone_df['name'].str.split('(').str[0].str.strip()
cellphone_df['capacity'] = cellphone_df['name'].str.split('(').str[1].str.replace(')','',regex=False).str.strip()
cellphone_df.drop(columns='name', inplace=True)

cellphone_df['size'] = cellphone_df['size'].str.replace('"','',regex=False).astype('float')

cellphone_df

,brand,size,price,battery,weight,year,model,capacity
0,Apple,6.1,1250.0,3729,172.0,2022,iPhone 14,128GB
1,Apple,6.1,1400.0,3729,172.0,2022,iPhone 14,256GB
2,Apple,6.1,1700.0,3729,172.0,2022,iPhone 14,512GB
3,Apple,6.7,1350.0,4325,203.0,2022,iPhone 14 Plus,128GB
4,Apple,6.7,1500.0,4325,203.0,2022,iPhone 14 Plus,256GB
...,...,...,...,...,...,...,...,...
65,Samsung,6.9,1793.0,5000,220.0,2020,Galaxy S20 Ultra,512GB
66,Samsung,6.7,1353.0,4500,186.0,2020,Galaxy S20+,256GB
67,Samsung,6.7,1650.0,3300,183.0,2020,Galaxy Z Flip2,256GB
68,Samsung,7.6,1892.0,4500,282.0,2020,Galaxy Z Fold2,256GB
69,Samsung,7.6,3960.0,4500,282.0,2020,Galaxy Z Fold2 Thom Browne Edition,256GB

In [86]:
patient_df = pd.read_csv('data/patient.csv')

patient_df

     age     sex  glucose  cholesterol  height  weight  hip  waist diabetes
0     50    Male      385          140    1.75    78.0   41     37        Y
1     37  Female       67          214    1.63    65.8   42     34        N
2     43  Female      100          160    1.63    63.5   40     37        N
3     32  Female       90          176    1.60   114.3   58     45        N
4     20    Male       71          164    1.83    65.8   36     29        N
..   ...     ...      ...          ...     ...     ...  ...    ...      ...
343   40    Male       87          218    1.85    90.7   41     38        N
344   66    Male      174          188    1.73    95.3   48     45        N
345   31  Female       69          183    1.68    86.2   47     41        N
346   44    Male       84          202    1.73    71.2   37     33        N
347   40  Female       85          169    1.65    81.6   44     40        N

[348 rows x 9 columns]

In [87]:
round(patient_df['waist'] / patient_df['hip'],2)

0      0.90
1      0.81
2      0.92
3      0.78
4      0.81
       ...
343    0.93
344    0.94
345    0.87
346    0.89
347    0.91
Length: 348, dtype: float64

In [88]:
patient_df['waist_hip_ratio'] = round(patient_df['waist'] / patient_df['hip'],2)

patient_df

,age,sex,glucose,cholesterol,height,weight,hip,waist,diabetes,waist_hip_ratio
0,50,Male,385,140,1.75,78.0,41,37,Y,0.90
1,37,Female,67,214,1.63,65.8,42,34,N,0.81
2,43,Female,100,160,1.63,63.5,40,37,N,0.92
3,32,Female,90,176,1.60,114.3,58,45,N,0.78
4,20,Male,71,164,1.83,65.8,36,29,N,0.81
...,...,...,...,...,...,...,...,...,...,...
343,40,Male,87,218,1.85,90.7,41,38,N,0.93
344,66,Male,174,188,1.73,95.3,48,45,N,0.94
345,31,Female,69,183,1.68,86.2,47,41,N,0.87
346,44,Male,84,202,1.73,71.2,37,33,N,0.89
347,40,Female,85,169,1.65,81.6,44,40,N,0.91

In [89]:
patient_df['bmi'] = round(patient_df['weight'] / (patient_df['height']**2),1)

patient_df

,age,sex,glucose,cholesterol,height,weight,hip,waist,diabetes,waist_hip_ratio,bmi
0,50,Male,385,140,1.75,78.0,41,37,Y,0.90,25.5
1,37,Female,67,214,1.63,65.8,42,34,N,0.81,24.8
2,43,Female,100,160,1.63,63.5,40,37,N,0.92,23.9
3,32,Female,90,176,1.60,114.3,58,45,N,0.78,44.6
4,20,Male,71,164,1.83,65.8,36,29,N,0.81,19.6
...,...,...,...,...,...,...,...,...,...,...,...
343,40,Male,87,218,1.85,90.7,41,38,N,0.93,26.5
344,66,Male,174,188,1.73,95.3,48,45,N,0.94,31.8
345,31,Female,69,183,1.68,86.2,47,41,N,0.87,30.5
346,44,Male,84,202,1.73,71.2,37,33,N,0.89,23.8
347,40,Female,85,169,1.65,81.6,44,40,N,0.91,30.0

In [90]:
(patient_df['height'] - patient_df['height'].min()) /\
(patient_df['height'].max() - patient_df['height'].min())

0      0.704918
1      0.508197
2      0.508197
3      0.459016
4      0.836066
         ...
343    0.868852
344    0.672131
345    0.590164
346    0.672131
347    0.540984
Name: height, Length: 348, dtype: float64

In [91]:
patient_df['height'] = (patient_df['height'] - patient_df['height'].min()) /\
(patient_df['height'].max() - patient_df['height'].min()) 

patient_df['height'].describe()

count    348.000000
mean       0.590588
std        0.163932
min        0.000000
25%        0.459016
50%        0.590164
75%        0.704918
max        1.000000
Name: height, dtype: float64

In [92]:
patient_df['weight'] = (patient_df['weight'] - patient_df['weight'].min()) / \
(patient_df['weight'].max() - patient_df['weight'].min())

patient_df

,age,sex,glucose,cholesterol,height,weight,hip,waist,diabetes,waist_hip_ratio,bmi
0,50,Male,385,140,0.704918,0.322927,41,37,Y,0.90,25.5
1,37,Female,67,214,0.508197,0.203902,42,34,N,0.81,24.8
2,43,Female,100,160,0.508197,0.181463,40,37,N,0.92,23.9
3,32,Female,90,176,0.459016,0.677073,58,45,N,0.78,44.6
4,20,Male,71,164,0.836066,0.203902,36,29,N,0.81,19.6
...,...,...,...,...,...,...,...,...,...,...,...
343,40,Male,87,218,0.868852,0.446829,41,38,N,0.93,26.5
344,66,Male,174,188,0.672131,0.491707,48,45,N,0.94,31.8
345,31,Female,69,183,0.590164,0.402927,47,41,N,0.87,30.5
346,44,Male,84,202,0.672131,0.256585,37,33,N,0.89,23.8
347,40,Female,85,169,0.540984,0.358049,44,40,N,0.91,30.0

In [93]:
patient_df['age'].describe()

count    348.000000
mean      43.505747
std       13.473101
min       20.000000
25%       33.000000
50%       42.000000
75%       55.000000
max       69.000000
Name: age, dtype: float64

In [94]:
pd.cut(patient_df['age'],bins=[20,30,40,50,60,70])

0      (40.0, 50.0]
1      (30.0, 40.0]
2      (40.0, 50.0]
3      (30.0, 40.0]
4               NaN
           ...
343    (30.0, 40.0]
344    (60.0, 70.0]
345    (30.0, 40.0]
346    (40.0, 50.0]
347    (30.0, 40.0]
Name: age, Length: 348, dtype: category
Categories (5, interval[int64, right]): [(20, 30] < (30, 40] < (40, 50] < (50, 60] < (60, 70]]

In [95]:
patient_df['age_group'] = pd.cut(patient_df['age'],
                                 bins=[20,30,40,50,60,70])

In [96]:
patient_df

,age,sex,glucose,cholesterol,height,weight,hip,waist,diabetes,waist_hip_ratio,bmi,age_group
0,50,Male,385,140,0.704918,0.322927,41,37,Y,0.90,25.5,"(40.0, 50.0]"
1,37,Female,67,214,0.508197,0.203902,42,34,N,0.81,24.8,"(30.0, 40.0]"
2,43,Female,100,160,0.508197,0.181463,40,37,N,0.92,23.9,"(40.0, 50.0]"
3,32,Female,90,176,0.459016,0.677073,58,45,N,0.78,44.6,"(30.0, 40.0]"
4,20,Male,71,164,0.836066,0.203902,36,29,N,0.81,19.6,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
343,40,Male,87,218,0.868852,0.446829,41,38,N,0.93,26.5,"(30.0, 40.0]"
344,66,Male,174,188,0.672131,0.491707,48,45,N,0.94,31.8,"(60.0, 70.0]"
345,31,Female,69,183,0.590164,0.402927,47,41,N,0.87,30.5,"(30.0, 40.0]"
346,44,Male,84,202,0.672131,0.256585,37,33,N,0.89,23.8,"(40.0, 50.0]"
347,40,Female,85,169,0.540984,0.358049,44,40,N,0.91,30.0,"(30.0, 40.0]"

In [97]:
patient_df['age_group'] = pd.cut(patient_df['age'],
                                 bins=[20,30,40,50,60,70],
                                 right=False)

patient_df

,age,sex,glucose,cholesterol,height,weight,hip,waist,diabetes,waist_hip_ratio,bmi,age_group
0,50,Male,385,140,0.704918,0.322927,41,37,Y,0.90,25.5,"[50, 60)"
1,37,Female,67,214,0.508197,0.203902,42,34,N,0.81,24.8,"[30, 40)"
2,43,Female,100,160,0.508197,0.181463,40,37,N,0.92,23.9,"[40, 50)"
3,32,Female,90,176,0.459016,0.677073,58,45,N,0.78,44.6,"[30, 40)"
4,20,Male,71,164,0.836066,0.203902,36,29,N,0.81,19.6,"[20, 30)"
...,...,...,...,...,...,...,...,...,...,...,...,...
343,40,Male,87,218,0.868852,0.446829,41,38,N,0.93,26.5,"[40, 50)"
344,66,Male,174,188,0.672131,0.491707,48,45,N,0.94,31.8,"[60, 70)"
345,31,Female,69,183,0.590164,0.402927,47,41,N,0.87,30.5,"[30, 40)"
346,44,Male,84,202,0.672131,0.256585,37,33,N,0.89,23.8,"[40, 50)"
347,40,Female,85,169,0.540984,0.358049,44,40,N,0.91,30.0,"[40, 50)"

In [98]:
patient_df['age_group'] = pd.cut(patient_df['age'],
                                 bins=[20,30,40,50,60,70],
                                 right=False,
                                 labels=['20s','30s','40s','50s','60s'])

patient_df

,age,sex,glucose,cholesterol,height,weight,hip,waist,diabetes,waist_hip_ratio,bmi,age_group
0,50,Male,385,140,0.704918,0.322927,41,37,Y,0.90,25.5,50s
1,37,Female,67,214,0.508197,0.203902,42,34,N,0.81,24.8,30s
2,43,Female,100,160,0.508197,0.181463,40,37,N,0.92,23.9,40s
3,32,Female,90,176,0.459016,0.677073,58,45,N,0.78,44.6,30s
4,20,Male,71,164,0.836066,0.203902,36,29,N,0.81,19.6,20s
...,...,...,...,...,...,...,...,...,...,...,...,...
343,40,Male,87,218,0.868852,0.446829,41,38,N,0.93,26.5,40s
344,66,Male,174,188,0.672131,0.491707,48,45,N,0.94,31.8,60s
345,31,Female,69,183,0.590164,0.402927,47,41,N,0.87,30.5,30s
346,44,Male,84,202,0.672131,0.256585,37,33,N,0.89,23.8,40s
347,40,Female,85,169,0.540984,0.358049,44,40,N,0.91,30.0,40s

In [99]:
import pandas as pd
import numpy as np

patient_df = pd.read_csv('data/patient.csv')
patient_df['bmi'] = round(patient_df['weight'] / patient_df['height']**2, 1)

# 여기에 코드를 작성하세요.

patient_df['obesity'] = pd.cut(patient_df['bmi'],
                               bins=[0,18.5,25,30,patient_df['bmi'].max()+1],
                               labels=['under','healthy','over','obese'],
                               right=False)

patient_df

,age,sex,glucose,cholesterol,height,weight,hip,waist,diabetes,bmi,obesity
0,50,Male,385,140,1.75,78.0,41,37,Y,25.5,over
1,37,Female,67,214,1.63,65.8,42,34,N,24.8,healthy
2,43,Female,100,160,1.63,63.5,40,37,N,23.9,healthy
3,32,Female,90,176,1.60,114.3,58,45,N,44.6,obese
4,20,Male,71,164,1.83,65.8,36,29,N,19.6,healthy
...,...,...,...,...,...,...,...,...,...,...,...
343,40,Male,87,218,1.85,90.7,41,38,N,26.5,over
344,66,Male,174,188,1.73,95.3,48,45,N,31.8,obese
345,31,Female,69,183,1.68,86.2,47,41,N,30.5,obese
346,44,Male,84,202,1.73,71.2,37,33,N,23.8,healthy
347,40,Female,85,169,1.65,81.6,44,40,N,30.0,obese

In [100]:
order_df = pd.read_csv('data/order.csv')

order_df

,order_time,category,product_name,price,quantity,sales,days_for_shipping(expected),shipping_time
0,2015-01-01 04:54:00,Cleats,Perfect Fitness Perfect Rip Deck,59.99,3,179.97,6,2015-01-07 19:07:00
1,NaN,Men's Footwear,Nike Men's CJ Elite 2 TD Football Cleat,129.99,1,129.99,6,2015-01-04 09:47:00
2,2015-01-01 02:27:00,Indoor/Outdoor Games,O'Brien Men's Neoprene Life Vest,49.98,4,199.92,6,2015-01-05 13:15:00
3,2015-01-01 19:58:00,Golf Gloves,Clicgear 8.0 Shoe Brush,9.99,2,19.98,6,2015-01-05 12:08:00
4,2015-01-01 03:51:00,Camping & Hiking,Diamondback Women's Serene Classic Comfort Bi,299.98,1,299.98,6,2015-01-04 20:06:00
...,...,...,...,...,...,...,...,...
18045,2018-01-31 10:20:00,Women's Clothing,Summer dresses,215.82,1,215.82,4,2018-02-02 13:53:00
18046,2018-01-31 21:53:00,Women's Clothing,Summer dresses,215.82,1,215.82,3,2018-02-02 18:50:00
18047,2018-01-31 17:20:00,Women's Clothing,Summer dresses,215.82,1,215.82,6,2018-02-02 10:16:00
18048,2018-01-31 12:26:00,Women's Clothing,Summer dresses,215.82,1,215.82,6,2018-02-03 18:58:00
18049,2018-01-31 16:59:00,Women's Clothing,Summer dresses,215.82,1,215.82,6,2018-02-06 20:32:00

In [101]:
order_df.dtypes

order_time                      object
category                        object
product_name                    object
price                          float64
quantity                         int64
sales                          float64
days_for_shipping(expected)      int64
shipping_time                   object
dtype: object

In [102]:
order_df['order_time'] = pd.to_datetime(order_df['order_time'])
order_df['shipping_time'] = pd.to_datetime(order_df['shipping_time'])

order_df.dtypes

order_time                     datetime64[ns]
category                               object
product_name                           object
price                                 float64
quantity                                int64
sales                                 float64
days_for_shipping(expected)             int64
shipping_time                  datetime64[ns]
dtype: object

In [103]:
order_df = pd.read_csv('data/order.csv', parse_dates=['order_time','shipping_time'])

order_df.dtypes

order_time                     datetime64[ns]
category                               object
product_name                           object
price                                 float64
quantity                                int64
sales                                 float64
days_for_shipping(expected)             int64
shipping_time                  datetime64[ns]
dtype: object

In [104]:
order_df.isna().sum()

order_time                     1
category                       0
product_name                   0
price                          0
quantity                       0
sales                          0
days_for_shipping(expected)    0
shipping_time                  0
dtype: int64

In [105]:
order_df.dropna(inplace=True)

order_df

,order_time,category,product_name,price,quantity,sales,days_for_shipping(expected),shipping_time
0,2015-01-01 04:54:00,Cleats,Perfect Fitness Perfect Rip Deck,59.99,3,179.97,6,2015-01-07 19:07:00
2,2015-01-01 02:27:00,Indoor/Outdoor Games,O'Brien Men's Neoprene Life Vest,49.98,4,199.92,6,2015-01-05 13:15:00
3,2015-01-01 19:58:00,Golf Gloves,Clicgear 8.0 Shoe Brush,9.99,2,19.98,6,2015-01-05 12:08:00
4,2015-01-01 03:51:00,Camping & Hiking,Diamondback Women's Serene Classic Comfort Bi,299.98,1,299.98,6,2015-01-04 20:06:00
5,2015-01-01 22:04:00,Women's Apparel,Nike Men's Dri-FIT Victory Golf Polo,50.00,3,150.00,3,2015-01-03 19:47:00
...,...,...,...,...,...,...,...,...
18045,2018-01-31 10:20:00,Women's Clothing,Summer dresses,215.82,1,215.82,4,2018-02-02 13:53:00
18046,2018-01-31 21:53:00,Women's Clothing,Summer dresses,215.82,1,215.82,3,2018-02-02 18:50:00
18047,2018-01-31 17:20:00,Women's Clothing,Summer dresses,215.82,1,215.82,6,2018-02-02 10:16:00
18048,2018-01-31 12:26:00,Women's Clothing,Summer dresses,215.82,1,215.82,6,2018-02-03 18:58:00
18049,2018-01-31 16:59:00,Women's Clothing,Summer dresses,215.82,1,215.82,6,2018-02-06 20:32:00

In [106]:
order_df['order_time'].dt.date

0        2015-01-01
2        2015-01-01
3        2015-01-01
4        2015-01-01
5        2015-01-01
            ...
18045    2018-01-31
18046    2018-01-31
18047    2018-01-31
18048    2018-01-31
18049    2018-01-31
Name: order_time, Length: 18049, dtype: object

In [107]:
# order_df = order_df.set_index('order_time').sort_index()

order_df

,order_time,category,product_name,price,quantity,sales,days_for_shipping(expected),shipping_time
0,2015-01-01 04:54:00,Cleats,Perfect Fitness Perfect Rip Deck,59.99,3,179.97,6,2015-01-07 19:07:00
2,2015-01-01 02:27:00,Indoor/Outdoor Games,O'Brien Men's Neoprene Life Vest,49.98,4,199.92,6,2015-01-05 13:15:00
3,2015-01-01 19:58:00,Golf Gloves,Clicgear 8.0 Shoe Brush,9.99,2,19.98,6,2015-01-05 12:08:00
4,2015-01-01 03:51:00,Camping & Hiking,Diamondback Women's Serene Classic Comfort Bi,299.98,1,299.98,6,2015-01-04 20:06:00
5,2015-01-01 22:04:00,Women's Apparel,Nike Men's Dri-FIT Victory Golf Polo,50.00,3,150.00,3,2015-01-03 19:47:00
...,...,...,...,...,...,...,...,...
18045,2018-01-31 10:20:00,Women's Clothing,Summer dresses,215.82,1,215.82,4,2018-02-02 13:53:00
18046,2018-01-31 21:53:00,Women's Clothing,Summer dresses,215.82,1,215.82,3,2018-02-02 18:50:00
18047,2018-01-31 17:20:00,Women's Clothing,Summer dresses,215.82,1,215.82,6,2018-02-02 10:16:00
18048,2018-01-31 12:26:00,Women's Clothing,Summer dresses,215.82,1,215.82,6,2018-02-03 18:58:00
18049,2018-01-31 16:59:00,Women's Clothing,Summer dresses,215.82,1,215.82,6,2018-02-06 20:32:00

In [108]:
import pandas as pd

delivery_df = pd.read_csv('data/delivery.csv')

# 여기에 코드를 작성하세요.

delivery_df['order_time'] = pd.to_datetime(delivery_df['order_time'])
delivery_df = delivery_df.set_index('order_time').sort_index()

delivery_df.loc['2022-10-17']

                     distance  time_taken  num_of_deliveries  charge
order_time
2022-10-17 18:34:00       3.9          21                  1    4.68
2022-10-17 18:35:00       5.2          24                  1    7.02
2022-10-17 18:36:00       8.4          36                  2    9.53
2022-10-17 18:37:00       3.6          17                  1    6.21
2022-10-17 18:41:00       2.6          15                  1    2.44
2022-10-17 18:54:00      15.2          34                  1   13.72
2022-10-17 18:54:00       2.4          14                  1    2.00
2022-10-17 18:54:00      13.7          50                  2    8.74
2022-10-17 18:55:00       7.6          28                  1    5.52
2022-10-17 18:55:00       3.3          16                  1    6.95
2022-10-17 19:16:00       4.7          19                  1    3.54
2022-10-17 19:17:00      12.5          43                  2   14.34
2022-10-17 19:17:00       3.0          16                  1    3.42
2022-10-17 19:19:00       8.5          30                  1   10.30
2022-10-17 19:20:00       5.2          22                  1    3.09
2022-10-17 19:21:00       2.1          14                  1    3.00
2022-10-17 19:21:00      16.5          52                  2   13.78
2022-10-17 19:22:00       8.3          30                  2   13.86

In [109]:
import pandas as pd

delivery_df = pd.read_csv('data/delivery.csv', parse_dates=['order_time'])

# 여기에 코드를 작성하세요.

delivery_df['time_taken'] = pd.to_timedelta(delivery_df['time_taken'],unit='min')

delivery_df['delivery_time'] = delivery_df['order_time'] + delivery_df['time_taken']

delivery_df

,order_time,distance,time_taken,num_of_deliveries,charge,delivery_time
0,2022-10-17 18:34:00,3.9,0 days 00:21:00,1,4.68,2022-10-17 18:55:00
1,2022-10-17 18:35:00,5.2,0 days 00:24:00,1,7.02,2022-10-17 18:59:00
2,2022-10-17 18:36:00,8.4,0 days 00:36:00,2,9.53,2022-10-17 19:12:00
3,2022-10-17 18:37:00,3.6,0 days 00:17:00,1,6.21,2022-10-17 18:54:00
4,2022-10-17 18:41:00,2.6,0 days 00:15:00,1,2.44,2022-10-17 18:56:00
...,...,...,...,...,...,...
104,2022-10-23 19:28:00,6.4,0 days 00:37:00,1,5.01,2022-10-23 20:05:00
105,2022-10-23 19:28:00,3.9,0 days 00:26:00,2,7.34,2022-10-23 19:54:00
106,2022-10-23 19:48:00,3.3,0 days 00:21:00,1,3.83,2022-10-23 20:09:00
107,2022-10-23 19:49:00,5.8,0 days 00:22:00,1,5.80,2022-10-23 20:11:00
108,2022-10-23 19:50:00,4.4,0 days 00:19:00,1,7.78,2022-10-23 20:09:00

In [110]:
import pandas as pd

sales_2020_df = pd.read_csv('data/sales_2020.csv')
sales_2021_df = pd.read_csv('data/sales_2021.csv')
sales_2022_df = pd.read_csv('data/sales_2022.csv')

# 여기에 코드를 작성하세요.
sales_df = pd.concat([sales_2020_df,sales_2021_df,sales_2022_df])

sales_df

,year,month,total_orders,gross_sales,discounts,returns,total_sales
0,2020,January,73,8861.50,-129.40,-448.45,8283.65
1,2020,February,56,6908.50,-104.70,-416.20,6387.60
2,2020,March,60,5778.50,-172.20,-1017.20,4589.10
3,2020,April,70,8814.00,-281.40,0.00,8532.60
4,2020,May,54,6677.00,-185.75,-253.80,6237.45
5,2020,June,68,9621.50,-234.45,-17.50,9369.55
6,2020,July,66,6480.00,-51.50,-469.20,5959.30
7,2020,August,55,8025.00,-258.90,-26.00,7740.10
8,2020,September,68,7075.00,-61.70,-281.00,6732.30
9,2020,October,59,5720.00,-88.00,-305.00,5327.00
10,2020,November,91,13025.00,-131.30,-323.85,12569.85
11,2020,December,116,10356.05,-149.85,-414.20,9792.00
0,2021,January,83,8923.00,-217.10,-26.25,8679.65
1,2021,February,69,6529.20,-161.35,-118.15,6249.70
2,2021,March,64,7442.70,-226.82,-8.80,7207.08
3,2021,April,81,9406.35,-232.28,-40.00,9134.07
4,2021,May,82,7493.90,-221.25,-1448.02,5824.63
5,2021,June,124,13260.80,-335.40,-1506.53,11418.87
6,2021,July,102,9274.95,-237.87,-689.98,8347.10
7,2021,August,82,7698.70,-140.57,-197.35,7360.78
8,2021,September,79,10582.85,-276.15,0.00,10306.70
9,2021,October,71,7014.50,-277.95,-294.75,6441.80
10,2021,November,140,12002.70,-414.45,-154.40,11433.85
11,2021,December,164,13683.50,-371.20,-928.35,12383.95
0,2022,January,87,7811.75,-261.97,-1250.35,6299.43
1,2022,February,63,6523.70,-288.70,-38.70,6196.30
2,2022,March,99,13075.50,-439.85,-981.00,11654.65
3,2022,April,92,6977.00,-285.40,-10.00,6681.60
4,2022,May,96,10082.25,-460.90,-173.35,9448.00
5,2022,June,85,7321.75,-186.02,-165.40,6970.33
6,2022,July,94,9739.20,-447.07,-908.75,8383.38
7,2022,August,105,8839.50,-201.67,-84.37,8553.46
8,2022,September,88,9077.45,-354.89,-853.35,7869.21
9,2022,October,97,9132.25,-279.42,-1572.55,7280.28
10,2022,November,272,23997.90,-776.84,-364.51,22856.55
11,2022,December,342,31183.90,-2269.51,-1311.18,27603.21

In [111]:
emp_df = pd.read_csv('data/employee.csv')
sur_df = pd.read_csv('data/survey.csv')

In [112]:
emp_df

        id department  location             role resign
0   101929         HR     China            Staff      Y
1   101625    Finance        US  Senior Director      N
2   100298         HR     China          Manager      N
3   101870    Finance  Colombia          Manager      N
4   101318         IT     Japan     Senior Staff      N
..     ...        ...       ...              ...    ...
95  100476         HR  Colombia   Senior Manager      Y
96  100226         HR        UK   Senior Manager      N
97  101331         IT     Korea          Manager      N
98  100036         HR        UK          Manager      N
99  100233      Sales     Japan            Staff      N

[100 rows x 5 columns]

In [114]:
sur_df

        id department  career  teamwork  reward  environment
0   101355         HR       5         4       5            4
1   100077      Sales       2         2       4            3
2   101844    Finance       2         3       1            5
3   101929         HR       2         3       2            3
4   101888         HR       4         4       3            3
..     ...        ...     ...       ...     ...          ...
71  101449         HR       4         3       3            5
72  101423    Finance       1         2       1            4
73  101098         IT       1         3       4            4
74  100618         IT       5         2       1            2
75  100488    Finance       5         4       1            5

[76 rows x 6 columns]

In [119]:
pd.merge(emp_df, sur_df,on='id', how='left', suffixes=('','_x'))

,id,department,location,role,resign,department_x,career,teamwork,reward,environment
0,101929,HR,China,Staff,Y,HR,2.0,3.0,2.0,3.0
1,101625,Finance,US,Senior Director,N,Finance,2.0,2.0,3.0,1.0
2,100298,HR,China,Manager,N,NaN,NaN,NaN,NaN,NaN
3,101870,Finance,Colombia,Manager,N,NaN,NaN,NaN,NaN,NaN
4,101318,IT,Japan,Senior Staff,N,IT,2.0,3.0,5.0,5.0
...,...,...,...,...,...,...,...,...,...,...
95,100476,HR,Colombia,Senior Manager,Y,HR,1.0,2.0,3.0,5.0
96,100226,HR,UK,Senior Manager,N,HR,2.0,2.0,3.0,4.0
97,101331,IT,Korea,Manager,N,IT,3.0,5.0,4.0,4.0
98,100036,HR,UK,Manager,N,NaN,NaN,NaN,NaN,NaN
99,100233,Sales,Japan,Staff,N,Sales,4.0,2.0,2.0,5.0

In [120]:
sur_df = sur_df.rename(columns={'id':'employee_id'})
sur_df

    employee_id department  career  teamwork  reward  environment
0        101355         HR       5         4       5            4
1        100077      Sales       2         2       4            3
2        101844    Finance       2         3       1            5
3        101929         HR       2         3       2            3
4        101888         HR       4         4       3            3
..          ...        ...     ...       ...     ...          ...
71       101449         HR       4         3       3            5
72       101423    Finance       1         2       1            4
73       101098         IT       1         3       4            4
74       100618         IT       5         2       1            2
75       100488    Finance       5         4       1            5

[76 rows x 6 columns]

In [123]:
com_df = pd.merge(emp_df, sur_df, left_on='id', right_on='employee_id')
com_df

,id,department_x,location,role,resign,employee_id,department_y,career,teamwork,reward,environment
0,101929,HR,China,Staff,Y,101929,HR,2,3,2,3
1,101625,Finance,US,Senior Director,N,101625,Finance,2,2,3,1
2,101318,IT,Japan,Senior Staff,N,101318,IT,2,3,5,5
3,100936,HR,Japan,Manager,Y,100936,HR,3,2,2,4
4,100125,HR,Korea,Senior Staff,N,100125,HR,3,4,4,4
...,...,...,...,...,...,...,...,...,...,...,...
71,102031,IT,Colombia,Senior Manager,Y,102031,IT,1,3,3,1
72,100476,HR,Colombia,Senior Manager,Y,100476,HR,1,2,3,5
73,100226,HR,UK,Senior Manager,N,100226,HR,2,2,3,4
74,101331,IT,Korea,Manager,N,101331,IT,3,5,4,4
75,100233,Sales,Japan,Staff,N,100233,Sales,4,2,2,5

In [124]:
import pandas as pd

asteroid_df = pd.read_csv('data/asteroid.csv')
orbit_df = pd.read_csv('data/orbit.csv')

# 여기에 코드를 작성하세요.

asteroid_df

,id,abs_magnitude,min_est_diameter,max_est_diameter,relative_velocity
0,3753583,24.922,0.027552,0.061608,78734.416695
1,3736681,21.200,0.152952,0.342011,78315.420560
2,2226514,20.100,0.253837,0.567597,103175.288522
3,3674619,21.300,0.146068,0.326618,70196.294986
4,3608670,25.100,0.025384,0.056760,26652.631636
...,...,...,...,...,...
337,2468727,20.800,0.183889,0.411188,40225.448389
338,3736502,21.400,0.139494,0.311918,60813.804409
339,3738553,25.000,0.026580,0.059435,26988.425817
340,3484640,20.200,0.242412,0.542051,48648.982689
341,2041429,20.600,0.201630,0.450858,51264.256945

In [125]:
orbit_df

     asteroid_id  orbit_id  min_orbit_inter  perihelion_dist  inclination
0        2489486        45         0.020437         0.924281    15.090005
1        2196068        38         0.026944         0.710371    59.379202
2        2177049        79         0.000143         0.546414     0.650215
3        2465617        22         0.032103         0.956639     9.111115
4        3758926         9         0.035563         0.853339    30.576089
..           ...       ...              ...              ...          ...
145      2418849        39         0.035770         0.897503    33.524100
146      2141851        96         0.037918         0.179558    19.175872
147      2162882        81         0.032884         0.463728     6.497318
148      2382406        28         0.004718         0.286323     2.536137
149      3182172        36         0.032270         0.656464    32.829100

[150 rows x 5 columns]

In [127]:
nasa_df = pd.merge(asteroid_df,orbit_df, left_on='id', right_on='asteroid_id')
nasa_df

,id,abs_magnitude,min_est_diameter,max_est_diameter,relative_velocity,asteroid_id,orbit_id,min_orbit_inter,perihelion_dist,inclination
0,2226514,20.1,0.253837,0.567597,103175.288522,2226514,54,0.015130,0.420701,2.564450
1,3674619,21.3,0.146068,0.326618,70196.294986,3674619,8,0.018203,0.355309,2.544707
2,3644702,20.2,0.242412,0.542051,111504.879722,3644702,43,0.039390,0.468663,29.290232
3,3019647,20.6,0.201630,0.450858,86093.161070,3019647,16,0.024227,0.318180,19.803694
4,2208115,20.7,0.192555,0.430566,45195.716041,2208115,29,0.013353,0.838391,23.293402
...,...,...,...,...,...,...,...,...,...,...
152,2085938,18.6,0.506471,1.132505,48435.858841,2085938,112,0.022124,0.956925,9.145916
153,3745504,21.7,0.121494,0.271669,113607.187316,3745504,23,0.023437,0.639498,5.151032
154,2468727,20.8,0.183889,0.411188,40225.448389,2468727,29,0.034385,0.509222,16.920882
155,3736502,21.4,0.139494,0.311918,60813.804409,3736502,17,0.021474,0.948154,8.061251
156,2041429,20.6,0.201630,0.450858,51264.256945,2041429,68,0.010898,0.708209,2.173195

In [130]:
emp_df = pd.read_csv('data/employee.csv')
sur_df = pd.read_csv('data/survey.csv')

sur_df = sur_df.rename(columns={'id':'employee_id'})

emp_df = emp_df.set_index('id')
sur_df = sur_df.set_index('employee_id')

emp_df.join(sur_df, lsuffix='_x', rsuffix='_y')

,department_x,location,role,resign,department_y,career,teamwork,reward,environment
id,,,,,,,,,
101929,HR,China,Staff,Y,HR,2.0,3.0,2.0,3.0
101625,Finance,US,Senior Director,N,Finance,2.0,2.0,3.0,1.0
100298,HR,China,Manager,N,NaN,NaN,NaN,NaN,NaN
101870,Finance,Colombia,Manager,N,NaN,NaN,NaN,NaN,NaN
101318,IT,Japan,Senior Staff,N,IT,2.0,3.0,5.0,5.0
...,...,...,...,...,...,...,...,...,...
100476,HR,Colombia,Senior Manager,Y,HR,1.0,2.0,3.0,5.0
100226,HR,UK,Senior Manager,N,HR,2.0,2.0,3.0,4.0
101331,IT,Korea,Manager,N,IT,3.0,5.0,4.0,4.0
100036,HR,UK,Manager,N,NaN,NaN,NaN,NaN,NaN
100233,Sales,Japan,Staff,N,Sales,4.0,2.0,2.0,5.0

In [131]:
emp_df.join(sur_df, rsuffix='_y')

,department,location,role,resign,department_y,career,teamwork,reward,environment
id,,,,,,,,,
101929,HR,China,Staff,Y,HR,2.0,3.0,2.0,3.0
101625,Finance,US,Senior Director,N,Finance,2.0,2.0,3.0,1.0
100298,HR,China,Manager,N,NaN,NaN,NaN,NaN,NaN
101870,Finance,Colombia,Manager,N,NaN,NaN,NaN,NaN,NaN
101318,IT,Japan,Senior Staff,N,IT,2.0,3.0,5.0,5.0
...,...,...,...,...,...,...,...,...,...
100476,HR,Colombia,Senior Manager,Y,HR,1.0,2.0,3.0,5.0
100226,HR,UK,Senior Manager,N,HR,2.0,2.0,3.0,4.0
101331,IT,Korea,Manager,N,IT,3.0,5.0,4.0,4.0
100036,HR,UK,Manager,N,NaN,NaN,NaN,NaN,NaN
100233,Sales,Japan,Staff,N,Sales,4.0,2.0,2.0,5.0

In [133]:
com_df = emp_df.join(sur_df, rsuffix='_x', how='inner')

com_df

,department,location,role,resign,department_x,career,teamwork,reward,environment
101929,HR,China,Staff,Y,HR,2,3,2,3
101625,Finance,US,Senior Director,N,Finance,2,2,3,1
101318,IT,Japan,Senior Staff,N,IT,2,3,5,5
100936,HR,Japan,Manager,Y,HR,3,2,2,4
100125,HR,Korea,Senior Staff,N,HR,3,4,4,4
...,...,...,...,...,...,...,...,...,...
102031,IT,Colombia,Senior Manager,Y,IT,1,3,3,1
100476,HR,Colombia,Senior Manager,Y,HR,1,2,3,5
100226,HR,UK,Senior Manager,N,HR,2,2,3,4
101331,IT,Korea,Manager,N,IT,3,5,4,4
100233,Sales,Japan,Staff,N,Sales,4,2,2,5

In [134]:
import pandas as pd

asteroid_df = pd.read_csv('data/asteroid.csv', index_col='id')
orbit_df = pd.read_csv('data/orbit.csv', index_col='asteroid_id')

# 여기에 코드를 작성하세요.

asteroid_df.join(orbit_df,how='inner')

,abs_magnitude,min_est_diameter,max_est_diameter,relative_velocity,orbit_id,min_orbit_inter,perihelion_dist,inclination
id,,,,,,,,
2226514,20.1,0.253837,0.567597,103175.288522,54,0.015130,0.420701,2.564450
3674619,21.3,0.146068,0.326618,70196.294986,8,0.018203,0.355309,2.544707
3644702,20.2,0.242412,0.542051,111504.879722,43,0.039390,0.468663,29.290232
3019647,20.6,0.201630,0.450858,86093.161070,16,0.024227,0.318180,19.803694
2208115,20.7,0.192555,0.430566,45195.716041,29,0.013353,0.838391,23.293402
...,...,...,...,...,...,...,...,...
2085938,18.6,0.506471,1.132505,48435.858841,112,0.022124,0.956925,9.145916
3745504,21.7,0.121494,0.271669,113607.187316,23,0.023437,0.639498,5.151032
2468727,20.8,0.183889,0.411188,40225.448389,29,0.034385,0.509222,16.920882
3736502,21.4,0.139494,0.311918,60813.804409,17,0.021474,0.948154,8.061251
2041429,20.6,0.201630,0.450858,51264.256945,68,0.010898,0.708209,2.173195

In [135]:
netflix_df = pd.read_csv('data/netflix.csv')

netflix_df

,title,genre,release,runtime,score,language
0,Dark Forces,Thriller,2020-08-21,81,2.6,Spanish
1,Leyla Everlasting,Comedy,2020-12-04,112,3.7,Turkish
2,Sardar Ka Grandson,Comedy,2021-05-18,139,4.1,Hindi
3,Searching for Sheela,Documentary,2021-04-22,58,4.1,English
4,The Call,Drama,2020-11-27,112,4.1,Korean
...,...,...,...,...,...,...
225,Seaspiracy,Documentary,2021-03-24,89,8.2,English
226,The Three Deaths of Marisela Escobedo,Documentary,2020-10-14,109,8.2,Spanish
227,Dancing with the Birds,Documentary,2019-10-23,51,8.3,English
228,Emicida: AmarElo - It's All For Yesterday,Documentary,2020-12-08,89,8.6,Portuguese
229,David Attenborough: A Life on Our Planet,Documentary,2020-10-04,83,9.0,English

In [136]:
netflix_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 230 entries, 0 to 229
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   title     230 non-null    object
 1   genre     230 non-null    object
 2   release   230 non-null    object
 3   runtime   230 non-null    int64
 4   score     230 non-null    float64
 5   language  230 non-null    object
dtypes: float64(1), int64(1), object(4)
memory usage: 10.9+ KB

In [138]:
netflix_df.describe(include='all')

              title        genre     release     runtime       score language
count           230          230         230  230.000000  230.000000      230
unique          230            5         180         NaN         NaN       18
top     Dark Forces  Documentary  2020-10-02         NaN         NaN  English
freq              1           80           4         NaN         NaN      130
mean            NaN          NaN         NaN   95.595652    6.252174      NaN
std             NaN          NaN         NaN   24.607965    1.002952      NaN
min             NaN          NaN         NaN   16.000000    2.600000      NaN
25%             NaN          NaN         NaN   87.250000    5.600000      NaN
50%             NaN          NaN         NaN   97.000000    6.300000      NaN
75%             NaN          NaN         NaN  108.750000    7.000000      NaN
max             NaN          NaN         NaN  151.000000    9.000000      NaN

In [139]:
netflix_df.groupby('genre')

In [140]:
netflix_df.groupby('genre').count()

                 title  release  runtime  score  language
genre
Comedy              33       33       33     33        33
Documentary         80       80       80     80        80
Drama               59       59       59     59        59
Romantic comedy     27       27       27     27        27
Thriller            31       31       31     31        31

In [142]:
netflix_df.groupby('genre').size().sum()

np.int64(230)

In [144]:
netflix_df.groupby('genre').min(numeric_only=True)

                 runtime  score
genre
Comedy                30    3.7
Documentary           16    4.1
Drama                 17    4.1
Romantic comedy       85    4.1
Thriller              81    2.6

In [145]:
netflix_df.groupby('genre').max(numeric_only=True)

                 runtime  score
genre
Comedy               139    7.2
Documentary          144    9.0
Drama                151    7.9
Romantic comedy      131    6.8
Thriller             149    7.3

In [146]:
netflix_df.groupby('genre').mean(numeric_only=True)

                    runtime     score
genre
Comedy            95.575758  5.518182
Documentary       81.262500  6.941250
Drama            106.440678  6.267797
Romantic comedy  101.555556  5.722222
Thriller         106.774194  5.687097

In [147]:
netflix_df.groupby('genre').sum(numeric_only=True)

                 runtime  score
genre
Comedy              3154  182.1
Documentary         6501  555.3
Drama               6280  369.8
Romantic comedy     2742  154.5
Thriller            3310  176.3

In [149]:
netflix_df.groupby('genre')['score'].mean()

genre
Comedy             5.518182
Documentary        6.941250
Drama              6.267797
Romantic comedy    5.722222
Thriller           5.687097
Name: score, dtype: float64

In [151]:
import pandas as pd

olympic_df = pd.read_csv('data/olympic.csv')

# 여기에 코드를 작성하세요.

olympic_df

,name,sex,age,height,weight,team,noc,sport,event,medal
0,"Voldimars ""Valdemar"" Bandolowski",M,30,184.0,82.0,Denmark,DEN,Sailing,Sailing Mixed Three Person Keelboat,1st
1,Verner Blaudzun,M,30,173.0,68.0,Denmark,DEN,Cycling,Cycling Men's 100 kilometres Team Time Trial,3rd
2,Niels Christian Fredborg,M,29,176.0,75.0,Denmark,DEN,Cycling,"Cycling Men's 1,000 metres Time Trial",3rd
3,Enith Sijtje Maria Brigitha (-Salle),F,21,174.0,67.0,Netherlands,NED,Swimming,Swimming Women's 100 metres Freestyle,3rd
4,Enith Sijtje Maria Brigitha (-Salle),F,21,174.0,67.0,Netherlands,NED,Swimming,Swimming Women's 200 metres Freestyle,3rd
...,...,...,...,...,...,...,...,...,...,...
608,Slavko Obadov,M,28,180.0,80.0,Yugoslavia,YUG,Judo,Judo Men's Middleweight,3rd
609,Momir Petkovi,M,22,179.0,82.0,Yugoslavia,YUG,Wrestling,"Wrestling Men's Middleweight, Greco-Roman",1st
610,Ace Rusevski,M,19,173.0,60.0,Yugoslavia,YUG,Boxing,Boxing Men's Lightweight,3rd
611,Gu Yong-Jo,M,21,172.0,57.0,North Korea,PRK,Boxing,Boxing Men's Bantamweight,1st
612,Li Byong-Uk,M,21,158.0,50.0,North Korea,PRK,Boxing,Boxing Men's Light-Flyweight,2nd

In [155]:
olympic_df.groupby('sport').mean(numeric_only=True)[['height','weight']]

                       height     weight
sport
Archery            170.000000  64.333333
Athletics          179.540541  74.373874
Basketball         186.000000  78.000000
Boxing             174.767442  64.837209
Canoeing           181.393939  80.090909
Cycling            178.888889  76.000000
Diving             169.500000  62.750000
Equestrianism      177.777778  70.444444
Fencing            177.125000  71.500000
Football           180.000000  76.000000
Gymnastics         162.727273  55.204545
Handball           182.500000  78.833333
Hockey             175.000000  69.000000
Judo               177.375000  86.916667
Modern Pentathlon  183.166667  75.833333
Rowing             183.071429  80.761905
Sailing            182.944444  78.555556
Shooting           177.476190  76.952381
Swimming           177.736111  69.388889
Volleyball         181.000000  77.833333
Water Polo         195.333333  92.000000
Weightlifting      167.074074  82.129630
Wrestling          171.783333  75.716667

In [157]:
netflix_df.groupby('genre')

In [162]:
netflix_df['year'] = pd.to_datetime(netflix_df['release']).dt.year

In [163]:
netflix_df

,title,genre,release,runtime,score,language,year
0,Dark Forces,Thriller,2020-08-21,81,2.6,Spanish,2020
1,Leyla Everlasting,Comedy,2020-12-04,112,3.7,Turkish,2020
2,Sardar Ka Grandson,Comedy,2021-05-18,139,4.1,Hindi,2021
3,Searching for Sheela,Documentary,2021-04-22,58,4.1,English,2021
4,The Call,Drama,2020-11-27,112,4.1,Korean,2020
...,...,...,...,...,...,...,...
225,Seaspiracy,Documentary,2021-03-24,89,8.2,English,2021
226,The Three Deaths of Marisela Escobedo,Documentary,2020-10-14,109,8.2,Spanish,2020
227,Dancing with the Birds,Documentary,2019-10-23,51,8.3,English,2019
228,Emicida: AmarElo - It's All For Yesterday,Documentary,2020-12-08,89,8.6,Portuguese,2020
229,David Attenborough: A Life on Our Planet,Documentary,2020-10-04,83,9.0,English,2020

In [164]:
netflix_df.dtypes

title        object
genre        object
release      object
runtime       int64
score       float64
language     object
year          int32
dtype: object

In [165]:
netflix_df.groupby(['genre','year']).mean(numeric_only=True)

                         runtime     score
genre           year
Comedy          2019   84.250000  5.625000
                2020  100.857143  5.571429
                2021  104.428571  5.228571
Documentary     2019   82.033333  6.920000
                2020   82.611111  7.177778
                2021   76.142857  6.378571
Drama           2019  107.857143  6.335714
                2020  103.000000  6.055556
                2021  110.500000  6.533333
Romantic comedy 2019   92.714286  5.871429
                2020  105.187500  5.687500
                2021  102.500000  5.600000
Thriller        2019  105.428571  5.842857
                2020  106.944444  5.666667
                2021  107.833333  5.566667

In [166]:
netflix_df.groupby(['year','genre']).mean(numeric_only=True)

                         runtime     score
year genre
2019 Comedy            84.250000  5.625000
     Documentary       82.033333  6.920000
     Drama            107.857143  6.335714
     Romantic comedy   92.714286  5.871429
     Thriller         105.428571  5.842857
2020 Comedy           100.857143  5.571429
     Documentary       82.611111  7.177778
     Drama            103.000000  6.055556
     Romantic comedy  105.187500  5.687500
     Thriller         106.944444  5.666667
2021 Comedy           104.428571  5.228571
     Documentary       76.142857  6.378571
     Drama            110.500000  6.533333
     Romantic comedy  102.500000  5.600000
     Thriller         107.833333  5.566667

In [167]:
netflix_df.groupby(['year','genre']).mean(numeric_only=True).loc[2020,:]

                    runtime     score
genre
Comedy           100.857143  5.571429
Documentary       82.611111  7.177778
Drama            103.000000  6.055556
Romantic comedy  105.187500  5.687500
Thriller         106.944444  5.666667

In [168]:
import pandas as pd

olympic_df = pd.read_csv('data/olympic.csv')

# 여기에 코드를 작성하세요.

olympic_df

,name,sex,age,height,weight,team,noc,sport,event,medal
0,"Voldimars ""Valdemar"" Bandolowski",M,30,184.0,82.0,Denmark,DEN,Sailing,Sailing Mixed Three Person Keelboat,1st
1,Verner Blaudzun,M,30,173.0,68.0,Denmark,DEN,Cycling,Cycling Men's 100 kilometres Team Time Trial,3rd
2,Niels Christian Fredborg,M,29,176.0,75.0,Denmark,DEN,Cycling,"Cycling Men's 1,000 metres Time Trial",3rd
3,Enith Sijtje Maria Brigitha (-Salle),F,21,174.0,67.0,Netherlands,NED,Swimming,Swimming Women's 100 metres Freestyle,3rd
4,Enith Sijtje Maria Brigitha (-Salle),F,21,174.0,67.0,Netherlands,NED,Swimming,Swimming Women's 200 metres Freestyle,3rd
...,...,...,...,...,...,...,...,...,...,...
608,Slavko Obadov,M,28,180.0,80.0,Yugoslavia,YUG,Judo,Judo Men's Middleweight,3rd
609,Momir Petkovi,M,22,179.0,82.0,Yugoslavia,YUG,Wrestling,"Wrestling Men's Middleweight, Greco-Roman",1st
610,Ace Rusevski,M,19,173.0,60.0,Yugoslavia,YUG,Boxing,Boxing Men's Lightweight,3rd
611,Gu Yong-Jo,M,21,172.0,57.0,North Korea,PRK,Boxing,Boxing Men's Bantamweight,1st
612,Li Byong-Uk,M,21,158.0,50.0,North Korea,PRK,Boxing,Boxing Men's Light-Flyweight,2nd

In [181]:
olympic_df.groupby(['sport','sex'])[['height','weight']].mean(numeric_only=True)

                           height     weight
sport             sex
Archery           F    166.333333  61.333333
                  M    173.666667  67.333333
Athletics         F    171.976190  65.071429
                  M    184.144928  80.036232
Basketball        F    175.666667  70.000000
                  M    196.333333  86.000000
Boxing            M    174.767442  64.837209
Canoeing          F    171.000000  68.333333
                  M    183.703704  82.703704
Cycling           M    178.888889  76.000000
Diving            F    165.166667  56.833333
                  M    173.833333  68.666667
Equestrianism     F    165.000000  55.500000
                  M    179.375000  72.312500
Fencing           F    168.000000  61.166667
                  M    180.166667  74.944444
Football          M    180.000000  76.000000
Gymnastics        F    156.222222  45.333333
                  M    167.230769  62.038462
Handball          F    170.000000  66.333333
                  M    195.000000  91.333333
Hockey            M    175.000000  69.000000
Judo              M    177.375000  86.916667
Modern Pentathlon M    183.166667  75.833333
Rowing            F    173.555556  70.166667
                  M    190.208333  88.708333
Sailing           M    182.944444  78.555556
Shooting          F    163.000000  73.000000
                  M    178.200000  77.150000
Swimming          F    170.948718  61.435897
                  M    185.757576  78.787879
Volleyball        F    172.333333  66.000000
                  M    189.666667  89.666667
Water Polo        M    195.333333  92.000000
Weightlifting     M    167.074074  82.129630
Wrestling         M    171.783333  75.716667

In [184]:
netflix_df.groupby('genre')['score'].agg('mean')

genre
Comedy             5.518182
Documentary        6.941250
Drama              6.267797
Romantic comedy    5.722222
Thriller           5.687097
Name: score, dtype: float64

In [185]:
netflix_df.groupby('genre')['score'].agg('max')

genre
Comedy             7.2
Documentary        9.0
Drama              7.9
Romantic comedy    6.8
Thriller           7.3
Name: score, dtype: float64

In [186]:
netflix_df.groupby('genre')['score'].agg(['mean','max','min'])

                     mean  max  min
genre
Comedy           5.518182  7.2  3.7
Documentary      6.941250  9.0  4.1
Drama            6.267797  7.9  4.1
Romantic comedy  5.722222  6.8  4.1
Thriller         5.687097  7.3  2.6

In [187]:
import pandas as pd

olympic_df = pd.read_csv('data/olympic.csv')

# 여기에 코드를 작성하세요.

olympic_df.groupby('sport')['age'].agg(['min','max'])

                   min  max
sport
Archery             19   33
Athletics           17   37
Basketball          19   27
Boxing              17   28
Canoeing            19   30
Cycling             18   33
Diving              16   29
Equestrianism       21   46
Fencing             19   35
Football            26   31
Gymnastics          14   29
Handball            20   28
Hockey              21   28
Judo                20   32
Modern Pentathlon   21   34
Rowing              17   30
Sailing             19   39
Shooting            21   39
Swimming            14   25
Volleyball          20   27
Water Polo          23   29
Weightlifting       20   35
Wrestling           19   33

In [188]:
pd.pivot_table(netflix_df, values='score', index='year', columns='genre')

genre    Comedy  Documentary     Drama  Romantic comedy  Thriller
year
2019   5.625000     6.920000  6.335714         5.871429  5.842857
2020   5.571429     7.177778  6.055556         5.687500  5.666667
2021   5.228571     6.378571  6.533333         5.600000  5.566667

In [189]:
pd.pivot_table(netflix_df, values='score', index='year', columns='genre', aggfunc='max')

genre  Comedy  Documentary  Drama  Romantic comedy  Thriller
year
2019      6.9          8.3    7.9              6.8       6.6
2020      7.2          9.0    7.8              6.4       7.3
2021      6.3          8.2    7.2              6.6       6.5

In [196]:
netflix_df

,title,genre,release,runtime,score,language,year
0,Dark Forces,Thriller,2020-08-21,81,2.6,Spanish,2020
1,Leyla Everlasting,Comedy,2020-12-04,112,3.7,Turkish,2020
2,Sardar Ka Grandson,Comedy,2021-05-18,139,4.1,Hindi,2021
3,Searching for Sheela,Documentary,2021-04-22,58,4.1,English,2021
4,The Call,Drama,2020-11-27,112,4.1,Korean,2020
...,...,...,...,...,...,...,...
225,Seaspiracy,Documentary,2021-03-24,89,8.2,English,2021
226,The Three Deaths of Marisela Escobedo,Documentary,2020-10-14,109,8.2,Spanish,2020
227,Dancing with the Birds,Documentary,2019-10-23,51,8.3,English,2019
228,Emicida: AmarElo - It's All For Yesterday,Documentary,2020-12-08,89,8.6,Portuguese,2020
229,David Attenborough: A Life on Our Planet,Documentary,2020-10-04,83,9.0,English,2020

In [190]:
import pandas as pd

olympic_df = pd.read_csv('data/olympic.csv')

# 여기에 코드를 작성하세요.

olympic_df

,name,sex,age,height,weight,team,noc,sport,event,medal
0,"Voldimars ""Valdemar"" Bandolowski",M,30,184.0,82.0,Denmark,DEN,Sailing,Sailing Mixed Three Person Keelboat,1st
1,Verner Blaudzun,M,30,173.0,68.0,Denmark,DEN,Cycling,Cycling Men's 100 kilometres Team Time Trial,3rd
2,Niels Christian Fredborg,M,29,176.0,75.0,Denmark,DEN,Cycling,"Cycling Men's 1,000 metres Time Trial",3rd
3,Enith Sijtje Maria Brigitha (-Salle),F,21,174.0,67.0,Netherlands,NED,Swimming,Swimming Women's 100 metres Freestyle,3rd
4,Enith Sijtje Maria Brigitha (-Salle),F,21,174.0,67.0,Netherlands,NED,Swimming,Swimming Women's 200 metres Freestyle,3rd
...,...,...,...,...,...,...,...,...,...,...
608,Slavko Obadov,M,28,180.0,80.0,Yugoslavia,YUG,Judo,Judo Men's Middleweight,3rd
609,Momir Petkovi,M,22,179.0,82.0,Yugoslavia,YUG,Wrestling,"Wrestling Men's Middleweight, Greco-Roman",1st
610,Ace Rusevski,M,19,173.0,60.0,Yugoslavia,YUG,Boxing,Boxing Men's Lightweight,3rd
611,Gu Yong-Jo,M,21,172.0,57.0,North Korea,PRK,Boxing,Boxing Men's Bantamweight,1st
612,Li Byong-Uk,M,21,158.0,50.0,North Korea,PRK,Boxing,Boxing Men's Light-Flyweight,2nd

In [191]:
olympic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 613 entries, 0 to 612
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    613 non-null    object
 1   sex     613 non-null    object
 2   age     613 non-null    int64
 3   height  606 non-null    float64
 4   weight  606 non-null    float64
 5   team    613 non-null    object
 6   noc     613 non-null    object
 7   sport   613 non-null    object
 8   event   613 non-null    object
 9   medal   613 non-null    object
dtypes: float64(2), int64(1), object(7)
memory usage: 48.0+ KB

In [215]:
import pandas as pd

olympic_df = pd.read_csv('data/olympic.csv')

# 여기에 코드를 작성하세요.

olympic_df.fillna(0,inplace=True)

pd.pivot_table(olympic_df, index='team', columns='medal',\
aggfunc='size', fill_value=0.0).sort_values(by=['1st','2nd','3rd','team'], ascending=False)

medal                 1st   2nd   3rd
team
Soviet Union         49.0  41.0  35.0
East Germany         40.0  25.0  25.0
United States        34.0  35.0  25.0
West Germany         10.0  12.0  17.0
Japan                 9.0   6.0  10.0
Poland                7.0   6.0  13.0
Bulgaria              6.0   9.0   7.0
Cuba                  6.0   4.0   3.0
Romania               4.0   9.0  14.0
Hungary               4.0   5.0  13.0
Finland               4.0   2.0   0.0
Sweden                4.0   1.0   0.0
Great Britain         3.0   5.0   5.0
Italy                 2.0   7.0   4.0
France                2.0   3.0   4.0
Yugoslavia            2.0   3.0   3.0
Czechoslovakia        2.0   2.0   4.0
New Zealand           2.0   1.0   1.0
South Korea           1.0   1.0   4.0
Switzerland           1.0   1.0   2.0
Norway                1.0   1.0   0.0
North Korea           1.0   1.0   0.0
Jamaica               1.0   1.0   0.0
Denmark               1.0   0.0   2.0
Mexico                1.0   0.0   1.0
Trinidad and Tobago   1.0   0.0   0.0
Canada                0.0   5.0   6.0
Belgium               0.0   3.0   3.0
Netherlands           0.0   2.0   3.0
Spain                 0.0   2.0   0.0
Portugal              0.0   2.0   0.0
Australia             0.0   1.0   4.0
Iran                  0.0   1.0   1.0
Venezuela             0.0   1.0   0.0
Mongolia              0.0   1.0   0.0
Brazil                0.0   0.0   2.0
Thailand              0.0   0.0   1.0
Puerto Rico           0.0   0.0   1.0
Pakistan              0.0   0.0   1.0
Bermuda               0.0   0.0   1.0
Austria               0.0   0.0   1.0